[
  {
    "title": "Art for Earth Panel",
    "location": "Online",
    "date": "July 1st, 2024",
    "description": "In collaboration with Ocean Busters and Paperwave, YOI hosted a panel discussion on the role of art inenvironmental activism.\n\nIn the face of escalating environmental crises, fromclimate change to biodiversity loss, the need forinnovative and impact solutions has never been moreurgent. This panel brings together a diverse group ofartists, environmentalists, and thought leaders to explorehow different art forms can address pressing environmentalissues, inspire action, and foster a deeper connectionwith the natural world!"
  },
  {
    "title": "Nautilis Live Ship-To-Interaction",
    "location": "BTHS YOI",
    "date": "June 13th, 2024",
    "description": "The BTHS YOI chapter hosted a live ship-to-ship interaction with the Nautilis, a research vessel operated by the Ocean Exploration Trust. Students had the opportunity to speak with scientists and engineers on board the Nautilis, learn about the latest discoveries in ocean exploration, and ask questions about careers in marine science."
  },
  {
    "title": "YOI World Ocean Day 2024 Zine Webinar",
    "location": "Online",
    "date": "June 8th, 2024",
    "description": "In celebration of World Ocean Day 2024, YOI hosted a webinar to showcase a zine compiled by the YOI team based on a contest hosted earlier. The zine featured over 25 artworks and poems from students around the world, all centered around the theme of ocean conservation and sustainability. The webinar included a panel discussion with the zine contributors, as well as a Q&A session with the audience. At the end of the event, two winners were announced to receive a special monetary prize for their contributions."
  },
  {
    "title": "YOI Ocean Activism Workshop",
    "location": "Online",
    "date": "July 27th, 2024",
    "description": "The YOI hosted an Ocean Activism Workshop to empower students to take action on ocean conservation issues. The workshop featured panelists from various environmental organizations, who shared their experiences and insights on effective activism strategies. Participants learned about the importance of advocacy, community engagement, and policy change in protecting the ocean and its marine life. The workshop also included interactive activities to help students strengthen their advocacy skills and develop their own innovative solutions for addressing ocean conservation challenges."
  }
]
